
win_x, win_y = 200, 100
win_width, win_height = 1000, 600

txt_hello = 'Добро пожаловать в программу по определению состояния здоровья!'
txt_next = 'Начать'
txt_instruction = ('Данное приложение позволит вам с помощью теста Руфье провести первичную диагностику вашего здоровья.\n'
                   'Проба Руфье предоставляет собой нагрузочный комплекс, предназначенный для оценки работоспособности сердца при физической нагрузке.\n'
                   'У испытуемого, находящегося в положении лёжа на спине в течении 5 минут, определяют частоту пульса за 15 секунд;\n'
                   'затем в течении 45 секунд испытуемый выполняет 30 пресиданий.\n'
                   'После окончания нагрузки испытуемый ложиться, и у него вновь посчитывается число пульсаций за первые 15 секунд\n'
                   'а потом - за последнии 15 секунд первой минуты периода востанивления.\n'
                   'Важно! Если в процессе проведения испытания вы почуствуете себя плохо(появится головокружение, шум в\n'
                   'ушах, сильная отдышка и др.), то тест необходимо прервать и обратиться к врачу.\n')

txt_title = 'Здоровье'
txt_name = 'Введите Ф.И.О.:'
txt_hintname = "Ф.И.О."
txt_age = 'Полных лет:'
txt_hintage = "0"
txt_test1 = ('Лягте на спину и замерьте пульс за 15 секунд. Нажмите кнопку "Начать первый тест", чтобы запустить таймер.\n'
             'Результат запишите соответствующее поле.\n')
txt_test2 = ('Выполните 30 пресиданий за 45 секунд. Для этого нажмите кнопку"Начать делать пресидания",\n'
             'чтобы запустить счётчик приседаний.\n')
txt_test3 = ('Лягте на спину и замерьте пульс сначала за первые 15 секунд минуты, затем полследние 15 секунд.\n'
             'Нажмите кнопку "Начать финальный тест", чтобы запустить таймер.\n'
             'Зелёным обозначены секунды, в течение которых необходимо\n'
             'проводитьизмерения, чёрным - минуты без замера пульсаций. Результаты запишите в соответствующие поля.\n')
txt_sendresults = 'Отправить результаты'
txt_hinttest1 = '0'
txt_hinttest2 = '0'
txt_hinttest3 = '0'
txt_starttest1 = 'Начать первый тест'
txt_starttest2 = 'Начать делать пресидания'
txt_starttest3 = 'Начать финальный тест'

txt_finalwin = 'Результаты'
txt_index = 'Индекс Руфье:'
txt_workheart = 'Работоспособность сердца:'